Table of Contents
 Class RebarPoint3D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a Point in 3D. Defines an Arc segment by radius.
[OpenModelClass("CI.StructModel.Structure.RebarPoint3D,CI.StructuralElements", "CI.StructModel.Structure.IRebarPoint3D,CI.BasicTypes")]
public class RebarPoint3D : Point3D
Inheritance
object
OpenObject
OpenElementId
Point3D
RebarPoint3D
Inherited Members
 Point3D.Name
 Point3D.X
 Point3D.Y
 Point3D.Z
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 BendRadius
Gets or sets the radius of the Arc
public double BendRadius { get; set; }
Property Value
double
 Edit this page